fio/outputs/testext2fyp/fio-rand-write.output
file1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
fio-3.12
Starting 4 processes
file1: Laying out IO file (1 file / 10240MiB)
file1: Laying out IO file (1 file / 10240MiB)
file1: Laying out IO file (1 file / 10240MiB)
[...]

file1: (groupid=0, jobs=1): err= 0: pid=1662: Mon Jul 27 19:59:02 2020
  write: IOPS=19.4k, BW=75.6MiB/s (79.3MB/s)(66.5GiB/900001msec); 0 zone resets
    slat (nsec): min=882, max=126952k, avg=44556.34, stdev=835622.71
    clat (usec): min=2, max=17855k, avg=775.40, stdev=34505.47
     lat (usec): min=14, max=17855k, avg=820.23, stdev=34515.13
    clat percentiles (usec):
     |  1.00th=[   68],  5.00th=[   90], 10.00th=[  101], 20.00th=[  117],
     | 30.00th=[  131], 40.00th=[  147], 50.00th=[  167], 60.00th=[  196],
     | 70.00th=[  237], 80.00th=[  297], 90.00th=[  433], 95.00th=[  693],
     | 99.00th=[19530], 99.50th=[21365], 99.90th=[33424], 99.95th=[35390],
     | 99.99th=[42730]
   bw (  KiB/s): min=14592, max=215920, per=27.75%, avg=85720.76, stdev=23332.63, samples=1625
   iops        : min= 3648, max=53980, avg=21430.18, stdev=5833.16, samples=1625
  lat (usec)   : 4=0.01%, 20=0.01%, 50=0.10%, 100=9.25%, 250=63.45%
  lat (usec)   : 500=18.96%, 750=3.83%, 1000=1.30%
  lat (msec)   : 2=0.53%, 4=0.18%, 10=0.08%, 20=1.48%, 50=0.83%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.19%, sys=26.66%, ctx=1965352, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17422809,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=1663: Mon Jul 27 19:59:02 2020
  write: IOPS=19.4k, BW=75.7MiB/s (79.3MB/s)(66.5GiB/900001msec); 0 zone resets
    slat (nsec): min=851, max=280537k, avg=44874.79, stdev=851372.01
    clat (nsec): min=1653, max=16421M, avg=775056.51, stdev=32115225.57
     lat (usec): min=4, max=16421k, avg=820.20, stdev=32126.08
    clat percentiles (usec):
     |  1.00th=[   56],  5.00th=[   84], 10.00th=[  100], 20.00th=[  117],
     | 30.00th=[  131], 40.00th=[  147], 50.00th=[  167], 60.00th=[  196],
     | 70.00th=[  233], 80.00th=[  285], 90.00th=[  392], 95.00th=[  668],
     | 99.00th=[19792], 99.50th=[21890], 99.90th=[33817], 99.95th=[35390],
     | 99.99th=[46400]
   bw (  KiB/s): min= 7336, max=373728, per=27.57%, avg=85179.18, stdev=27756.77, samples=1636
   iops        : min= 1834, max=93432, avg=21294.79, stdev=6939.19, samples=1636
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.33%, 100=9.70%
  lat (usec)   : 250=64.20%, 500=18.35%, 750=3.18%, 1000=1.19%
  lat (msec)   : 2=0.44%, 4=0.16%, 10=0.10%, 20=1.50%, 50=0.85%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=2.25%, sys=26.07%, ctx=2232674, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17430713,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=1664: Mon Jul 27 19:59:02 2020
  write: IOPS=19.2k, BW=75.0MiB/s (78.7MB/s)(65.9GiB/900000msec); 0 zone resets
    slat (nsec): min=892, max=174444k, avg=44693.94, stdev=834140.66
    clat (nsec): min=1513, max=19436M, avg=781548.27, stdev=36588776.11
     lat (usec): min=4, max=19436k, avg=826.51, stdev=36597.78
    clat percentiles (usec):
     |  1.00th=[   68],  5.00th=[   91], 10.00th=[  103], 20.00th=[  119],
     | 30.00th=[  133], 40.00th=[  149], 50.00th=[  169], 60.00th=[  198],
     | 70.00th=[  237], 80.00th=[  297], 90.00th=[  445], 95.00th=[  701],
     | 99.00th=[19530], 99.50th=[21365], 99.90th=[33424], 99.95th=[35390],
     | 99.99th=[40109]
   bw (  KiB/s): min=11153, max=214648, per=27.70%, avg=85561.24, stdev=22069.98, samples=1615
   iops        : min= 2788, max=53662, avg=21390.29, stdev=5517.50, samples=1615
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.14%, 100=8.52%
  lat (usec)   : 250=64.33%, 500=18.50%, 750=4.01%, 1000=1.32%
  lat (msec)   : 2=0.57%, 4=0.20%, 10=0.08%, 20=1.47%, 50=0.84%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.16%, sys=26.80%, ctx=2033061, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17284992,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=1665: Mon Jul 27 19:59:02 2020
  write: IOPS=19.3k, BW=75.4MiB/s (79.1MB/s)(66.3GiB/900001msec); 0 zone resets
    slat (nsec): min=952, max=174467k, avg=44431.45, stdev=836154.15
    clat (nsec): min=1774, max=19410M, avg=777609.15, stdev=36447670.92
     lat (usec): min=3, max=19410k, avg=822.31, stdev=36456.80
    clat percentiles (usec):
     |  1.00th=[   70],  5.00th=[   92], 10.00th=[  103], 20.00th=[  119],
     | 30.00th=[  133], 40.00th=[  149], 50.00th=[  167], 60.00th=[  196],
     | 70.00th=[  239], 80.00th=[  293], 90.00th=[  424], 95.00th=[  685],
     | 99.00th=[19530], 99.50th=[21365], 99.90th=[33424], 99.95th=[35390],
     | 99.99th=[44827]
   bw (  KiB/s): min= 2363, max=226448, per=27.84%, avg=85999.26, stdev=25206.39, samples=1615
   iops        : min=  590, max=56612, avg=21499.80, stdev=6301.60, samples=1615
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.08%, 100=8.50%
  lat (usec)   : 250=64.46%, 500=18.83%, 750=3.75%, 1000=1.31%
  lat (msec)   : 2=0.50%, 4=0.18%, 10=0.09%, 20=1.48%, 50=0.82%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.20%, sys=26.60%, ctx=1660063, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17373043,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=302MiB/s (316MB/s), 75.0MiB/s-75.7MiB/s (78.7MB/s-79.3MB/s), io=265GiB (285GB), run=900000-900001msec

Disk stats (read/write):
  sdb: ios=167/56091926, merge=0/1885108, ticks=124/56921889, in_queue=55638160, util=95.49%